georgebenett/gb_remote/firmware/sdkconfig.defaults.lite
# CONFIG_TARGET_DUAL_THROTTLE is not set
CONFIG_TARGET_LITE=y
CONFIG_LCD_HOR_RES=240
CONFIG_LCD_VER_RES=320
CONFIG_LCD_OFFSET_X=0
CONFIG_LCD_OFFSET_Y=0

# Target
CONFIG_IDF_TARGET="esp32s3"
CONFIG_IDF_TARGET_ESP32S3=y

# Console (USB Serial JTAG, not UART)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# Partition Table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# SPIRAM
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_QUAD=y
CONFIG_SPIRAM_TYPE_AUTO=y
CONFIG_SPIRAM_SPEED_40M=y
CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=16384
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=32768

# LVGL
CONFIG_LV_CONF_SKIP=y
CONFIG_LV_COLOR_16_SWAP=y

# Bluetooth Configuration
CONFIG_BT_ENABLED=y
CONFIG_BT_BLUEDROID_ENABLED=y
CONFIG_BT_BLE_ENABLED=y
CONFIG_BT_GATTC_ENABLE=y
CONFIG_BT_BLE_SMP_ENABLE=y
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y

# Coredump: panic handler writes an ELF core dump to the coredump partition;
# the config tool reads it back over USB (see handle_cmd_check_coredump).
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
CONFIG_ESP_COREDUMP_CHECKSUM_CRC32=y
CONFIG_ESP_COREDUMP_CHECK_BOOT=y
